sdaiErrorQuery
\details
The Error Query function shall return the error code resulting from the C binding function that most
recently executed unsuccessfully
\remarks
After returning the error code, subsequent executions of the ErrorQuery function shall return sdaiNO_ERR
until another C language binding function executes unsuccessfully. Prior to executing the Open
Session function, the Error Query function shall return sdaiSS_NOPN.
Possible error indicators:
sdaiSS_NOPN Session is not open.
\returns Standard error code: The error code of the most recent function that executed unsuccessfully.